Kamal-Sonani/GD32207C-EVAL-board-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
		s_RxBuffer[nPortIndex].Rdm.nChecksum = static_cast<uint16_t>(s_RxBuffer[nPortIndex].Rdm.nChecksum + data);

		const auto *p = reinterpret_cast<struct TRdmMessage*>(&s_RxBuffer[nPortIndex].data[0]);

		if (s_RxBuffer[nPortIndex].Rdm.nIndex == p->message_length) {
			s_RxBuffer[nPortIndex].State = TxRxState::CHECKSUMH;
		} else if (s_RxBuffer[nPortIndex].Rdm.nIndex > sizeof(struct TRdmMessage)) {
			s_RxBuffer[nPortIndex].State = TxRxState::IDLE;
		}
	}
		break;
	case TxRxState::CHECKSUMH:
		nIndex = s_RxBuffer[nPortIndex].Rdm.nIndex;
		s_RxBuffer[nPortIndex].data[nIndex] = data;
		s_RxBuffer[nPortIndex].Rdm.nIndex++;
		s_RxBuffer[nPortIndex].Rdm.nChecksum = static_cast<uint16_t>(s_RxBuffer[nPortIndex].Rdm.nChecksum - static_cast<uint16_t>(data << 8));

		s_RxBuffer[nPortIndex].State = TxRxState::CHECKSUML;
		break;
	case TxRxState::CHECKSUML: {
		nIndex = s_RxBuffer[nPortIndex].Rdm.nIndex;
		s_RxBuffer[nPortIndex].data[nIndex] = data;
		s_RxBuffer[nPortIndex].Rdm.nIndex++;
		s_RxBuffer[nPortIndex].Rdm.nChecksum = static_cast<uint16_t>(s_RxBuffer[nPortIndex].Rdm.nChecksum - data);

		const auto *p = reinterpret_cast<struct TRdmMessage *>(&s_RxBuffer[nPortIndex].data[0]);

		if (!((s_RxBuffer[nPortIndex].Rdm.nChecksum == 0) && (p->sub_start_code == E120_SC_SUB_MESSAGE))) {
			s_RxBuffer[nPortIndex].Dmx.nSlotsInPacket= 0; // This is correct.
		} else {
			s_RxBuffer[nPortIndex].Rdm.nIndex |= 0x4000;
		}

		s_RxBuffer[nPortIndex].State = TxRxState::IDLE;
	}
		break;
	case TxRxState::RDMDISCFE:
		nIndex = s_RxBuffer[nPortIndex].Rdm.nIndex;
		s_RxBuffer[nPortIndex].data[nIndex] = data;
		s_RxBuffer[nPortIndex].Rdm.nIndex++;

		if ((data == 0xAA) || (s_RxBuffer[nPortIndex].Rdm.nIndex == 9)) {
			s_RxBuffer[nPortIndex].Rdm.nDiscIndex = 0;
			s_RxBuffer[nPortIndex].State = TxRxState::RDMDISCEUID;
		}
		break;
	case TxRxState::RDMDISCEUID:
		nIndex = s_RxBuffer[nPortIndex].Rdm.nIndex;
		s_RxBuffer[nPortIndex].data[nIndex] = data;
		s_RxBuffer[nPortIndex].Rdm.nIndex++;
		s_RxBuffer[nPortIndex].Rdm.nDiscIndex++;

		if (s_RxBuffer[nPortIndex].Rdm.nDiscIndex == 2 * RDM_UID_SIZE) {
			s_RxBuffer[nPortIndex].Rdm.nDiscIndex = 0;
			s_RxBuffer[nPortIndex].State = TxRxState::RDMDISCECS;
		}
		break;
	case TxRxState::RDMDISCECS:
		nIndex = s_RxBuffer[nPortIndex].Rdm.nIndex;
		s_RxBuffer[nPortIndex].data[nIndex] = data;
		s_RxBuffer[nPortIndex].Rdm.nIndex++;

		s_RxBuffer[nPortIndex].Rdm.nDiscIndex++;

		if (s_RxBuffer[nPortIndex].Rdm.nDiscIndex == 4) {
			s_RxBuffer[nPortIndex].State = TxRxState::IDLE;
		}
		break;
	default:
		s_RxBuffer[nPortIndex].Dmx.nSlotsInPacket= 0; // This is correct.
		s_RxBuffer[nPortIndex].State = TxRxState::IDLE;
		break;
	}

	PE0_LOW();
	__DMB();
}

extern "C" {
#if defined (DMX_USE_USART0)
void USART0_IRQHandler(void) {
	irq_handler_dmx_rdm_input(USART0, dmxmulti::config::USART0_PORT);
}
#endif
#if defined (DMX_USE_USART1)
void USART1_IRQHandler(void) {
	irq_handler_dmx_rdm_input(USART1, dmxmulti::config::USART1_PORT);
}
#endif
#if defined (DMX_USE_USART2)
void USART2_IRQHandler(void) {
	irq_handler_dmx_rdm_input(USART2, dmxmulti::config::USART2_PORT);
}
#endif
#if defined (DMX_USE_UART3)
void UART3_IRQHandler(void) {
	irq_handler_dmx_rdm_input(UART3, dmxmulti::config::UART3_PORT);
}
#endif
#if defined (DMX_USE_UART4)
void UART4_IRQHandler(void) {
	irq_handler_dmx_rdm_input(UART4, dmxmulti::config::UART4_PORT);
}
#endif
#if defined (DMX_USE_USART5)
void USART5_IRQHandler(void) {
	irq_handler_dmx_rdm_input(USART5, dmxmulti::config::USART5_PORT);
}
#endif
#if defined (DMX_USE_UART6)
void UART6_IRQHandler(void) {
	irq_handler_dmx_rdm_input(UART6, dmxmulti::config::UART6_PORT);
}
#endif
#if defined (DMX_USE_UART7)
void UART7_IRQHandler(void) {
	irq_handler_dmx_rdm_input(UART7, dmxmulti::config::UART7_PORT);
}
#endif
}

void timer1_config() {
	rcu_periph_clock_enable(RCU_TIMER1);
	timer_deinit(TIMER1);

	timer_parameter_struct timer_initpara;

	timer_initpara.prescaler = 119;	///< TIMER1CLK = SystemCoreClock / 120 = 1MHz => us ticker
	timer_initpara.alignedmode = TIMER_COUNTER_EDGE;
	timer_initpara.counterdirection = TIMER_COUNTER_UP;
	timer_initpara.period = s_nDmxTransmitPeriod;
	timer_initpara.clockdivision = TIMER_CKDIV_DIV1;
	timer_initpara.repetitioncounter = 0;
	timer_init(TIMER1, &timer_initpara);

	timer_flag_clear(TIMER1, ~0);
	timer_interrupt_flag_clear(TIMER1, ~0);

	timer_channel_output_mode_config(TIMER1, TIMER_CH_0, TIMER_OC_MODE_ACTIVE); // Break
	timer_channel_output_mode_config(TIMER1, TIMER_CH_1, TIMER_OC_MODE_ACTIVE); // MAB
	timer_channel_output_mode_config(TIMER1, TIMER_CH_2, TIMER_OC_MODE_ACTIVE); // Data

	timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_0, 0);
	timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_1, s_nDmxTransmitBreakTime);
	timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_2, s_nDmxTransmitBreakTime + s_nDmxTransmitMabTime);

	timer_interrupt_enable(TIMER1, TIMER_INT_CH0 | TIMER_INT_CH1 | TIMER_INT_CH2);

	NVIC_SetPriority(TIMER1_IRQn, 0);
	NVIC_EnableIRQ(TIMER1_IRQn);

	timer_enable(TIMER1);
}

void timer2_config() {
	rcu_periph_clock_enable(RCU_TIMER2);
	timer_deinit(TIMER2);

	timer_parameter_struct timer_initpara;

	timer_initpara.prescaler = 119;	///< TIMER2CLK = SystemCoreClock / 120 = 1MHz => us ticker
	timer_initpara.alignedmode = TIMER_COUNTER_EDGE;
	timer_initpara.counterdirection = TIMER_COUNTER_UP;
	timer_initpara.period = static_cast<uint32_t>(~0);
	timer_initpara.clockdivision = TIMER_CKDIV_DIV1;
	timer_initpara.repetitioncounter = 0;
	timer_init(TIMER2, &timer_initpara);

	timer_flag_clear(TIMER2, ~0);
	timer_interrupt_flag_clear(TIMER2, ~0);

	timer_channel_output_mode_config(TIMER2, TIMER_CH_0, TIMER_OC_MODE_ACTIVE);
	timer_channel_output_mode_config(TIMER2, TIMER_CH_1, TIMER_OC_MODE_ACTIVE);
	timer_channel_output_mode_config(TIMER2, TIMER_CH_2, TIMER_OC_MODE_ACTIVE);
	timer_channel_output_mode_config(TIMER2, TIMER_CH_3, TIMER_OC_MODE_ACTIVE);

	NVIC_SetPriority(TIMER2_IRQn, 0);
	NVIC_EnableIRQ(TIMER2_IRQn);

	timer_enable(TIMER2);
}

void timer3_config() {
#if DMX_MAX_PORTS >= 5
	rcu_periph_clock_enable(RCU_TIMER3);
	timer_deinit(TIMER3);

	timer_parameter_struct timer_initpara;

