Kamal-Sonani/GD32207C-EVAL-board-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
extern "C" {
void TIMER1_IRQHandler() {
	__DMB();
	const auto nIntFlag = TIMER_INTF(TIMER1);
	const auto nUartsSending = s_nUartsSending;
	PE1_HIGH();

	if ((nIntFlag & TIMER_INT_FLAG_CH0) == TIMER_INT_FLAG_CH0) {		// Start break
#if defined (DMX_USE_USART0)
		gpio_init(USART0_GPIO_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, USART0_TX_PIN);
		if (nUartsSending & (1U << config::USART0_PORT)) {
			s_nUartsSending |= (1U << (config::USART0_PORT + 8));
			GPIO_BC(USART0_GPIO_PORT) = USART0_TX_PIN;
		}
#endif
#if defined (DMX_USE_USART1)
		gpio_init(USART1_GPIO_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, USART1_TX_PIN);
		if (nUartsSending & (1U << config::USART1_PORT)) {
			s_nUartsSending |= (1U << (config::USART1_PORT + 8));
			GPIO_BC(USART1_GPIO_PORT) = USART1_TX_PIN;
		}
#endif
#if defined (DMX_USE_USART2)
		gpio_init(USART2_GPIO_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, USART2_TX_PIN);
		if (nUartsSending & (1U << config::USART2_PORT)) {
			s_nUartsSending |= (1U << (config::USART2_PORT + 8));
			GPIO_BC(USART2_GPIO_PORT) = USART2_TX_PIN;
		}
#endif
#if defined (DMX_USE_UART3)
		gpio_init(UART3_GPIO_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, UART3_TX_PIN);
		if (nUartsSending & (1U << config::UART3_PORT)) {
			s_nUartsSending |= (1U << (config::UART3_PORT + 8));
			GPIO_BC(UART3_GPIO_PORT) = UART3_TX_PIN;
		}
#endif
#if defined (DMX_USE_UART4)
		gpio_init(UART4_GPIO_TX_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, UART4_TX_PIN);
		if (nUartsSending & (1U << config::UART4_PORT)) {
			s_nUartsSending |= (1U << (config::UART4_PORT + 8));
			GPIO_BC(UART4_GPIO_TX_PORT) = UART4_TX_PIN;
		}
#endif
#if defined (DMX_USE_USART5)
		gpio_init(USART5_GPIO_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, USART5_TX_PIN);
		if (nUartsSending & (1U << config::USART5_PORT)) {
			s_nUartsSending |= (1U << (config::USART5_PORT + 8));
			GPIO_BC(USART5_GPIO_PORT) = USART5_TX_PIN;
		}
#endif
#if defined (DMX_USE_UART6)
		gpio_init(UART6_GPIO_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, UART6_TX_PIN);
		if (nUartsSending & (1U << config::UART6_PORT)) {
			s_nUartsSending |= (1U << (config::UART6_PORT + 8));
			GPIO_BC(UART6_GPIO_PORT) = UART6_TX_PIN;
		}
#endif
#if defined (DMX_USE_UART7)
		gpio_init(UART7_GPIO_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, UART7_TX_PIN);
		if (nUartsSending & (1U << config::UART7_PORT)) {
			s_nUartsSending |= (1U << (config::UART7_PORT + 8));
			GPIO_BC(UART7_GPIO_PORT) = UART7_TX_PIN;
		}
#endif
	} else if ((nIntFlag & TIMER_INT_FLAG_CH1) == TIMER_INT_FLAG_CH1) {	// Stop break
#if defined (DMX_USE_USART0)
		if (nUartsSending & (1U << (config::USART0_PORT + 8))) {
			gpio_init(USART0_GPIO_PORT, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, USART0_TX_PIN);
		}
#endif
#if defined (DMX_USE_USART1)
		if (nUartsSending & (1U << (config::USART1_PORT + 8))) {
			gpio_init(USART1_GPIO_PORT, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, USART1_TX_PIN);
		}
#endif
#if defined (DMX_USE_USART2)
		if (nUartsSending & (1U << (config::USART2_PORT + 8))) {
			gpio_init(USART2_GPIO_PORT, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, USART2_TX_PIN);
		}
#endif
#if defined (DMX_USE_UART3)
		if (nUartsSending & (1U << (config::UART3_PORT + 8))) {
			gpio_init(UART3_GPIO_PORT, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ,  UART3_TX_PIN);
		}
#endif
#if defined (DMX_USE_UART4)
		if (nUartsSending & (1U << (config::UART4_PORT + 8))) {
			gpio_init(UART4_GPIO_TX_PORT, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, UART4_TX_PIN);
		}
#endif
#if defined (DMX_USE_USART5)
		if (nUartsSending & (1U << (config::USART5_PORT + 8))) {
			gpio_init(USART5_GPIO_PORT, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, USART5_TX_PIN);
		}
#endif
#if defined (DMX_USE_UART6)
		if (nUartsSending & (1U << (config::UART6_PORT + 8))) {
			gpio_init(UART6_GPIO_PORT, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, UART6_TX_PIN);
		}
#endif
#if defined (DMX_USE_UART7)
		if (nUartsSending & (1U << (config::UART7_PORT + 8))) {
			gpio_init(UART7_GPIO_PORT, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, UART7_TX_PIN);
		}
#endif
	} else if ((nIntFlag & TIMER_INT_FLAG_CH2) == TIMER_INT_FLAG_CH2) {	// Send data
#if defined (DMX_USE_USART0)
		if (nUartsSending & (1U << (config::USART0_PORT + 8))) {
			DMA_CHCTL(USART0_DMA, USART0_TX_DMA_CH) &= ~DMA_CHXCTL_CHEN;
			DMA_CHMADDR(USART0_DMA, USART0_TX_DMA_CH) = (uint32_t) s_TxBuffer[config::USART0_PORT].data;
			DMA_CHCNT(USART0_DMA, USART0_TX_DMA_CH) = (s_TxBuffer[config::USART0_PORT].nLength & DMA_CHANNEL_CNT_MASK);
			DMA_CHCTL(USART0_DMA, USART0_TX_DMA_CH) |= DMA_CHXCTL_CHEN;
			usart_dma_transmit_config(USART0, USART_DENT_ENABLE);
		}
#endif
#if defined (DMX_USE_USART1)
		if (nUartsSending & (1U << (config::USART1_PORT + 8))) {
			DMA_CHCTL(USART1_DMA, USART1_TX_DMA_CH) &= ~DMA_CHXCTL_CHEN;
			DMA_CHMADDR(USART1_DMA, USART1_TX_DMA_CH) = (uint32_t) s_TxBuffer[config::USART1_PORT].data;
			DMA_CHCNT(USART1_DMA, USART1_TX_DMA_CH) = (s_TxBuffer[config::USART1_PORT].nLength & DMA_CHANNEL_CNT_MASK);
			DMA_CHCTL(USART1_DMA, USART1_TX_DMA_CH) |= DMA_CHXCTL_CHEN;
			usart_dma_transmit_config(USART1, USART_DENT_ENABLE);
		}
#endif
#if defined (DMX_USE_USART2)
		if (nUartsSending & (1U << (config::USART2_PORT + 8))) {
			DMA_CHCTL(USART2_DMA, USART2_TX_DMA_CH) &= ~DMA_CHXCTL_CHEN;
			DMA_CHMADDR(USART2_DMA, USART2_TX_DMA_CH) = (uint32_t) s_TxBuffer[config::USART2_PORT].data;
			DMA_CHCNT(USART2_DMA, USART2_TX_DMA_CH) = (s_TxBuffer[config::USART2_PORT].nLength & DMA_CHANNEL_CNT_MASK);
			DMA_CHCTL(USART2_DMA, USART2_TX_DMA_CH) |= DMA_CHXCTL_CHEN;
			usart_dma_transmit_config(USART2, USART_DENT_ENABLE);
		}
#endif
#if defined (DMX_USE_UART3)
		if (nUartsSending & (1U << (config::UART3_PORT + 8))) {
			dma_channel_disable(UART3_DMA, UART3_TX_DMA_CH);
			DMA_CHMADDR(UART3_DMA, UART3_TX_DMA_CH) = (uint32_t) s_TxBuffer[config::UART3_PORT].data;
			DMA_CHCNT(UART3_DMA, UART3_TX_DMA_CH) = (s_TxBuffer[config::UART3_PORT].nLength & DMA_CHANNEL_CNT_MASK);
			dma_channel_enable(UART3_DMA, UART3_TX_DMA_CH);
			usart_dma_transmit_config(UART3, USART_DENT_ENABLE);
		}
#endif
#if defined (DMX_USE_UART4)
		if (nUartsSending & (1U << (config::UART4_PORT + 8))) {
			dma_channel_disable(UART4_DMA, UART4_TX_DMA_CH);
			DMA_CHMADDR(UART4_DMA, UART4_TX_DMA_CH) = (uint32_t) s_TxBuffer[config::UART4_PORT].data;
			DMA_CHCNT(UART4_DMA, UART4_TX_DMA_CH) = (s_TxBuffer[config::UART4_PORT].nLength & DMA_CHANNEL_CNT_MASK);
			dma_channel_enable(UART4_DMA, UART4_TX_DMA_CH);
			usart_dma_transmit_config(UART4, USART_DENT_ENABLE);
		}
#endif
#if defined (DMX_USE_USART5)
		if (nUartsSending & (1U << (config::USART5_PORT + 8))) {
			DMA_CHCTL(USART5_DMA, USART5_TX_DMA_CH) &= ~DMA_CHXCTL_CHEN;
			DMA_CHMADDR(USART5_DMA, USART5_TX_DMA_CH) = (uint32_t) s_TxBuffer[config::USART5_PORT].data;
			DMA_CHCNT(USART5_DMA, USART5_TX_DMA_CH) = (s_TxBuffer[config::USART5_PORT].nLength & DMA_CHANNEL_CNT_MASK);
			DMA_CHCTL(USART5_DMA, USART5_TX_DMA_CH) |= DMA_CHXCTL_CHEN;
			usart_dma_transmit_config(USART5, USART_DENT_ENABLE);
		}
#endif
#if defined (DMX_USE_UART6)
		if (nUartsSending & (1U << (config::UART6_PORT + 8))) {
			dma_channel_disable(UART6_DMA, UART6_TX_DMA_CH);
			DMA_CHMADDR(UART6_DMA, UART6_TX_DMA_CH) = (uint32_t) s_TxBuffer[config::UART6_PORT].data;
			DMA_CHCNT(UART6_DMA, UART6_TX_DMA_CH) = (s_TxBuffer[config::UART6_PORT].nLength & DMA_CHANNEL_CNT_MASK);
			dma_channel_enable(UART6_DMA, UART6_TX_DMA_CH);
			usart_dma_transmit_config(UART6, USART_DENT_ENABLE);
		}
#endif
#if defined (DMX_USE_UART7)
		if (nUartsSending & (1U << (config::UART7_PORT + 8))) {
			dma_channel_disable(UART7_DMA, UART7_TX_DMA_CH);
			DMA_CHMADDR(UART7_DMA, UART7_TX_DMA_CH) = (uint32_t) s_TxBuffer[config::UART6_PORT].data;
			DMA_CHCNT(UART7_DMA, UART7_TX_DMA_CH) = (s_TxBuffer[config::UART7_PORT].nLength & DMA_CHANNEL_CNT_MASK);
			dma_channel_enable(UART7_DMA, UART7_TX_DMA_CH);
			usart_dma_transmit_config(UART7, USART_DENT_ENABLE);
		}
#endif
	} else {
		// 0x00000013
	}

	timer_interrupt_flag_clear(TIMER1, nIntFlag);

