Kamal-Sonani/GD32207C-EVAL-board-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
// DMX Send

void Dmx::SetDmxBreakTime(uint32_t nBreakTime) {
	s_nDmxTransmitBreakTime = std::max(transmit::BREAK_TIME_MIN, nBreakTime);

	SetDmxPeriodTime(m_nDmxTransmitPeriodRequested);
}

void Dmx::SetDmxMabTime(uint32_t nMabTime) {
	s_nDmxTransmitMabTime = std::max(transmit::MAB_TIME_MIN, nMabTime);

	SetDmxPeriodTime(m_nDmxTransmitPeriodRequested);
}

void Dmx::SetDmxPeriodTime(uint32_t nPeriod) {
	m_nDmxTransmitPeriodRequested = nPeriod;

	auto nLengthMax = s_TxBuffer[0].nLength;

	for (uint32_t i = 1; i < 2; i++) { // TODO
		if (s_TxBuffer[i].nLength > nLengthMax) {
			nLengthMax = s_TxBuffer[i].nLength;
		}
	}

	const auto nPackageLengthMicroSeconds = s_nDmxTransmitBreakTime + s_nDmxTransmitMabTime + (nLengthMax * 44) + 44;

	if (nPeriod != 0) {
		if (nPeriod < nPackageLengthMicroSeconds) {
			s_nDmxTransmitPeriod = std::max(transmit::BREAK_TO_BREAK_TIME_MIN, nPackageLengthMicroSeconds + 44U);
		} else {
			s_nDmxTransmitPeriod = nPeriod;
		}
	} else {
		s_nDmxTransmitPeriod =  std::max(transmit::BREAK_TO_BREAK_TIME_MIN, nPackageLengthMicroSeconds + 44U);
	}

	DEBUG_PRINTF("nPeriod=%u, nLengthMax=%u, s_nDmxTransmitPeriod=%u", nPeriod, nLengthMax, s_nDmxTransmitPeriod);
}

void Dmx::SetDmxSlots(uint16_t nSlots) {
	if ((nSlots >= 2) && (nSlots <= dmx::max::CHANNELS)) {
		m_nDmxTransmitSlots = nSlots;

		for (uint32_t i = 0; i < dmxmulti::config::max::OUT; i++) {
			if (m_nDmxTransmissionLength[i] != 0) {
				m_nDmxTransmissionLength[i] = std::min(m_nDmxTransmissionLength[i], static_cast<uint32_t>(nSlots));
			}
		}

		SetDmxPeriodTime(m_nDmxTransmitPeriodRequested);
	}
}

void Dmx::SetPortSendDataWithoutSC(uint32_t nPort, const uint8_t *pData, uint32_t nLength) {
	assert(nPort < DMX_MAX_PORTS);

	auto *p = &s_TxBuffer[nPort];

	auto *pDst = p->data;
	nLength = std::min(nLength, static_cast<uint32_t>(m_nDmxTransmitSlots));
	p->nLength = nLength + 1U;

	__builtin_prefetch(pData);
	memcpy(&pDst[1], pData,  nLength);

	if (nLength != m_nDmxTransmissionLength[nPort]) {
		m_nDmxTransmissionLength[nPort] = nLength;
		SetDmxPeriodTime(m_nDmxTransmitPeriodRequested);
	}
}

// DMX Receive

#include <cstdio>

const uint8_t *Dmx::GetDmxAvailable(uint32_t nPort)  {
	assert(nPort < DMX_MAX_PORTS);

	if ((s_RxBuffer[nPort].Dmx.nSlotsInPacket & 0x8000) != 0x8000) {
		return nullptr;
	}

	s_RxBuffer[nPort].Dmx.nSlotsInPacket &= ~0x8000;
	s_RxBuffer[nPort].Dmx.nSlotsInPacket--;	// Remove SC from length

	return s_RxBuffer[nPort].data;
}

uint32_t Dmx::GetUpdatesPerSecond(uint32_t nPort) {
	assert(nPort < DMX_MAX_PORTS);
	__DMB();
	return sv_nRxDmxPackets[nPort].nPerSecond;
}

// RDM Send

void Dmx::RdmSendRaw(uint32_t nPort, const uint8_t* pRdmData, uint32_t nLength) {
	assert(nPort < DMX_MAX_PORTS);
	assert(pRdmData != nullptr);
	assert(nLength != 0);

	const auto nUart = _port_to_uart(nPort);

	while (RESET == usart_flag_get(nUart, USART_FLAG_TC))
		;

	switch (nUart) {
#if defined (DMX_USE_USART0)
		case USART0:
			gpio_init(USART0_GPIO_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, USART0_TX_PIN);
			GPIO_BC(USART0_GPIO_PORT) = USART0_TX_PIN;
			break;
#endif
#if defined (DMX_USE_USART1)
		case USART1:
			gpio_init(USART1_GPIO_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, USART1_TX_PIN);
			GPIO_BC(USART1_GPIO_PORT) = USART1_TX_PIN;
			break;
#endif
#if defined (DMX_USE_USART2)
		case USART2:
			gpio_init(USART2_GPIO_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, USART2_TX_PIN);
			GPIO_BC(USART2_GPIO_PORT) = USART2_TX_PIN;
			break;
#endif
#if defined (DMX_USE_UART3)
		case UART3:
			gpio_init(UART3_GPIO_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, UART3_TX_PIN);
			GPIO_BC(UART3_GPIO_PORT) = UART3_TX_PIN;
			break;
#endif
#if defined (DMX_USE_UART4)
		case UART4:
			gpio_init(UART4_GPIO_TX_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, UART4_TX_PIN);
			GPIO_BC(UART4_GPIO_TX_PORT) = UART4_TX_PIN;
			break;
#endif
#if defined (DMX_USE_USART5)
		case USART5:
			gpio_init(USART5_GPIO_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, USART5_TX_PIN);
			GPIO_BC(USART5_GPIO_PORT) = USART5_TX_PIN;
			break;
#endif
#if defined (DMX_USE_UART6)
		case UART6:
			gpio_init(UART6_GPIO_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, UART6_TX_PIN);
			GPIO_BC(UART6_GPIO_PORT) = UART6_TX_PIN;
			break;
#endif
#if defined (DMX_USE_UART7)
		case UART7:
			gpio_init(UART7_GPIO_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, UART7_TX_PIN);
			GPIO_BC(UART7_GPIO_PORT) = UART7_TX_PIN;
			break;
#endif
		default:
			assert(0);
			__builtin_unreachable();
			break;
	}

	udelay(RDM_TRANSMIT_BREAK_TIME);

	switch (nUart) {
#if defined (DMX_USE_USART0)
		case USART0:
			gpio_init(USART0_GPIO_PORT, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, USART0_TX_PIN);
			break;
#endif
#if defined (DMX_USE_USART1)
		case USART1:
			gpio_init(USART1_GPIO_PORT, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, USART1_TX_PIN);
			break;
#endif
#if defined (DMX_USE_USART2)
		case USART2:
			gpio_init(USART2_GPIO_PORT, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, USART2_TX_PIN);
			break;
#endif
#if defined (DMX_USE_UART3)
		case UART3:
			gpio_init(USART5_GPIO_PORT, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, UART3_TX_PIN);
			break;
#endif
#if defined (DMX_USE_UART4)
		case UART4:
			gpio_init(UART4_GPIO_TX_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, UART4_TX_PIN);
			break;
#endif
#if defined (DMX_USE_USART5)
		case USART5:
			gpio_init(USART5_GPIO_PORT, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, USART5_TX_PIN);
			break;
#endif
#if defined (DMX_USE_UART6)
		case UART6:
			gpio_init(UART6_GPIO_PORT, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, UART6_TX_PIN);
			break;
#endif
#if defined (DMX_USE_UART7)
		case UART7:
			gpio_init(UART7_GPIO_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, UART7_TX_PIN);
			break;
#endif
		default:
			assert(0);
			__builtin_unreachable();
			break;
	}

	udelay(RDM_TRANSMIT_MAB_TIME);

	for (uint32_t i = 0; i < nLength; i++) {
		while (RESET == usart_flag_get(nUart, USART_FLAG_TBE))
			;
		USART_DATA(nUart) = static_cast<uint16_t>(USART_DATA_DATA & pRdmData[i]);
	}

	while (SET == usart_flag_get(nUart, USART_FLAG_BSY)) {
		static_cast<void>(GET_BITS(USART_DATA(nUart), 0U, 8U));
	}

	DEBUG_EXIT
}

// RDM Receive

const uint8_t *Dmx::RdmReceive(uint32_t nPort) {
	assert(nPort < DMX_MAX_PORTS);

	if ((s_RxBuffer[nPort].Rdm.nIndex & 0x4000) != 0x4000) {
		return nullptr;
	}

	s_RxBuffer[nPort].Dmx.nSlotsInPacket = 0; // This is correct.
	return s_RxBuffer[nPort].data;
}

const uint8_t *Dmx::RdmReceiveTimeOut(uint32_t nPort, uint16_t nTimeOut) {
	assert(nPort < DMX_MAX_PORTS);

	uint8_t *p = nullptr;
	TIMER_CNT(TIMER5) = 0;

	do {
		if ((p = const_cast<uint8_t*>(RdmReceive(nPort))) != nullptr) {
			return p;
		}
	} while (TIMER_CNT(TIMER5) < nTimeOut);

	return nullptr;
}
